'use strict'
// --------------------------------№1--------------------------------
console.log('----------------Завдання 1----------------');
let number = 1;
do {
    console.log(`Number = ${number}`);
    number += 1;
} while (number <= 10);

// --------------------------------№2--------------------------------
console.log('----------------Завдання 2----------------');
let nbr = 1;
while (nbr <= 10) {
    if (nbr % 2) {
        console.log(`Число ${nbr} непарне.`);
    } else {
        console.log(`Число ${nbr} парне.`);
    }
    nbr += 1;
};

// --------------------------------№3--------------------------------
console.log('----------------Завдання 3----------------');
let num = 20;

while (num <= 28) {
    console.log(`Num = ${num}`);
    num += 1;
}

// --------------------------------№4--------------------------------
console.log('----------------Завдання 4----------------');

let Name = '';

do {
    Name = prompt("Введіь ім'я свого улюбленого героя!");
    if (Name) {
        console.log(`Ім'я улюбленого героя нашого користувача: ${Name}`);
    } else {
        console.log('Були введені не коректні дані або пропущена операція введення! Cпробуйте ще раз!');
    }
} while (Name.length < 6);