'use strict'
    //'Вік нашого користувача:',
    //'Вік друга нашого користувача:',


// ---------------------------------------------№1---------------------------------------------
const message = alert('Вітаємо Вас на нашому сайті!');

const userName = prompt('Введіть Своє ім`я, будь ласка!');
console.log('Ім`я нашого користувача:', userName);


// ---------------------------------------------№2---------------------------------------------
let ageUser = prompt('Введіть Свій вік будь ласка!');
let AgeUser = ageUser;
console.log('Вік нашого користувача:', ageUser);

let ageUsersFriend = prompt('Введіть вік Вашого друга, будь ласка!');
let AgeUsersFriend = ageUsersFriend;
console.log('Вік друга нашого користувача:', ageUsersFriend)


let sumUserAndUsersFriend = alert(AgeUser + AgeUsersFriend);
//let sumUserAndUsersFriend = alert('Сума віків нашого користувача і його друга:', (AgeUser + AgeUsersFriend));
console.log('Сума віків нашого користувача і його друга:', sumUserAndUsersFriend);


// ---------------------------------------------№3---------------------------------------------
let a = 6.6;
let b = 5.5;

console.log('Змінна a = 6.6; Змінна b = 5.5; Добуток змінних a і b дорівнює: ', a * b);


// ---------------------------------------------№4---------------------------------------------
let a1 = 5 + 3;
let a2 = 5 - 3;
let a3 = 5 * 3;
let a4 = 5 / 3;
let a5 = (5 * 3) * (5 / 3) + 25;

console.log('Змінна a1 = 5+3 =', a1);
console.log('Змінна a2 = 5-3 =', a2);
console.log('Змінна a3 = 5*3 =', a3);
console.log('Змінна a4 = 5/3 =', a4);
console.log('Змінна a5 = (5*3)*(5/3)+25 =', a5);

// ---------------------------------------------№5---------------------------------------------
let a6 = alert(5 % 3);
let a7 = alert(3 % 5);
let a8 = alert(5 + '3');
let a9 = alert('5' - 3); 
let a10 = alert(75 + 'кг');


// ---------------------------------------------№6---------------------------------------------
const height = 23;
const width = 10;
const s = width * height;

console.log('Площа нашого прямокутника дорівнює:', s, 'см.');


// ---------------------------------------------№7---------------------------------------------
const heightC = 10;
const dC = 4;
const v = heightC * dC;

console.log('Об`єм нашого циліндра дорівнює:', v, 'од. кубічних')

// ---------------------------------------------№8---------------------------------------------

